In [2]:
import pandas as pd

In [5]:
orders = pd.read_table('http://bit.ly/chiporders')

In [8]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [15]:
moiveusers  = pd.read_table('http://bit.ly/movieusers')
moiveusers.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [20]:
movieuser = pd.read_table('http://bit.ly/movieusers', sep='|') #sep to seperate | char

In [23]:
movieuser.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

In [25]:
# add header as None to each row
moiveusers  = pd.read_table('http://bit.ly/movieusers', sep='|', header=None)

In [28]:
moiveusers.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [30]:
# Adding cols to data 
user_col = ['id', 'age','gender','occupation', 'zip_code']
movieuser = pd.read_table("http://bit.ly/movieusers", sep='|', header=None, names=user_col)

In [33]:
movieuser.head()

   id  age gender  occupation zip_code
0   1   24      M  technician    85711
1   2   53      F       other    94043
2   3   23      M      writer    32067
3   4   24      M  technician    43537
4   5   33      F       other    15213